docs/draft/kedro-run.puml
@startuml
title "$ kedro run"

participant "$ kedro run" as cli
participant "See kedro-with-project.puml for details" as prelude
participant "Project directory\ncli.py" as project_cli
participant "KedroSession" as session
participant "KedroContext" as context
participant "Runner" as runner
participant "Hook manager" as hooks

cli->prelude: prepare click commands as prelude to this
prelude->project_cli: run
project_cli->session: create KedroSession
session->session: run
session->session: load KedroContext
session->context: get the selected pipeline
context->context: filter the pipeline based on command line arguments
session->context: get catalog with load version / save version
session->runner: create runner
session->hooks: get hook manager
hooks->hooks: before_pipeline_run
runner->runner: run the filtered pipeline with the catalog
hooks->hooks: on_pipeline_error (if runner fails)
hooks->hooks: after_pipeline_run
@enduml
